; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	spectrograph1 - mode
	image0 - mode
	Star3 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star4 - direction
	Star0 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star3)
	(supports instrument1 spectrograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
	(supports instrument2 image0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 image0)
	(calibration_target instrument5 Star0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon12)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 Star4)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 Star0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star14)
)
(:goal (and
	(pointing satellite1 Phenomenon13)
	(pointing satellite2 Star3)
	(pointing satellite3 Phenomenon15)
	(have_image Star5 spectrograph1)
	(have_image Star6 image0)
	(have_image Phenomenon7 image0)
	(have_image Planet8 spectrograph1)
	(have_image Star9 spectrograph1)
	(have_image Star10 image0)
	(have_image Phenomenon11 image0)
	(have_image Phenomenon12 image0)
	(have_image Phenomenon13 image0)
	(have_image Star14 spectrograph1)
	(have_image Phenomenon15 image0)
	(have_image Phenomenon16 spectrograph1)
))

)

; plan
1. (turn_to satellite3 phenomenon15 star14)
   deleted: (pointing satellite3 star14)
   added: (pointing satellite3 phenomenon15)
   goals met: 1 of 15
2. (turn_to satellite2 star3 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 star3)
   goals met: 2 of 15
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 15
4. (calibrate satellite1 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 2 of 15
5. (turn_to satellite1 phenomenon16 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon16)
   goals met: 2 of 15
6. (take_image satellite1 phenomenon16 instrument2 spectrograph1)
   added: (have_image phenomenon16 spectrograph1)
   goals met: 3 of 15
7. (turn_to satellite1 phenomenon15 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 phenomenon15)
   goals met: 3 of 15
8. (take_image satellite1 phenomenon15 instrument2 image0)
   added: (have_image phenomenon15 image0)
   goals met: 4 of 15
9. (turn_to satellite1 phenomenon12 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon12)
   goals met: 4 of 15
10. (take_image satellite1 phenomenon12 instrument2 image0)
   added: (have_image phenomenon12 image0)
   goals met: 5 of 15
11. (turn_to satellite1 phenomenon11 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon11)
   goals met: 5 of 15
12. (take_image satellite1 phenomenon11 instrument2 image0)
   added: (have_image phenomenon11 image0)
   goals met: 6 of 15
13. (turn_to satellite1 phenomenon7 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon7)
   goals met: 6 of 15
14. (take_image satellite1 phenomenon7 instrument2 image0)
   added: (have_image phenomenon7 image0)
   goals met: 7 of 15
15. (turn_to satellite1 planet8 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet8)
   goals met: 7 of 15
16. (take_image satellite1 planet8 instrument2 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 8 of 15
17. (turn_to satellite1 star10 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star10)
   goals met: 8 of 15
18. (take_image satellite1 star10 instrument2 image0)
   added: (have_image star10 image0)
   goals met: 9 of 15
19. (turn_to satellite1 star14 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star14)
   goals met: 9 of 15
20. (take_image satellite1 star14 instrument2 spectrograph1)
   added: (have_image star14 spectrograph1)
   goals met: 10 of 15
21. (turn_to satellite1 star5 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star5)
   goals met: 10 of 15
22. (take_image satellite1 star5 instrument2 spectrograph1)
   added: (have_image star5 spectrograph1)
   goals met: 11 of 15
23. (turn_to satellite1 star6 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star6)
   goals met: 11 of 15
24. (take_image satellite1 star6 instrument2 image0)
   added: (have_image star6 image0)
   goals met: 12 of 15
25. (turn_to satellite1 star9 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star9)
   goals met: 12 of 15
26. (take_image satellite1 star9 instrument2 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 13 of 15
27. (turn_to satellite1 phenomenon13 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon13)
   goals met: 14 of 15
28. (take_image satellite1 phenomenon13 instrument2 image0)
   added: (have_image phenomenon13 image0)
   goals met: 15 of 15
